constant/granularRheologyProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      granaularRheologyProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

granularRheology   on;//off;

granularDilatancy  off;

granularCohesion  off;

alphaMaxG       alphaMaxG [ 0 0 0 0 0 0 0 ] 0.61;

#include    "musControl"
//mus             mus  [ 0 0 0 0 0 0 0 ] 0.35;

//mu2             mu2  [ 0 0 0 0 0 0 0 ] 0.97;

I0              I0  [ 0 0 0 0 0 0 0 ] 0.6; //0.69;

Bphi            Bphi [ 0 0 0 0 0 0 0 ] 0.66; //0.31;

n               n [ 0 0 0 0 0 0 0 ] 2.5;

Dsmall          Dsmall [ 0 0 -1 0 0 0 0 ] 1e-4;

relaxPa         relaxPa [ 0 0 0 0 0 0 0 ] 3e-4; //1;

FrictionModel   MuI;

PPressureModel  MuI; //none;

FluidViscosityModel BoyerEtAl;

// ************************************************************************* //
