constant/musControl
mus             mus  [ 0 0 0 0 0 0 0 ] 0.63;
mu2             mu2  [ 0 0 0 0 0 0 0 ] 1.13;
